In [5]:
import pandas as pd

df=pd.read_csv("E:/DATA ANALYTICS/Com Project/customer_shopping_behavior.csv")
print("READ DONE")

READ DONE

In [3]:
df.head() # First 5 Row dega

,Customer ID,Age,Gender,Item Purchased,Category,Purchase Amount (USD),Location,Size,Color,Season,Review Rating,Subscription Status,Shipping Type,Discount Applied,Promo Code Used,Previous Purchases,Payment Method,Frequency of Purchases
0,1,55,Male,Blouse,Clothing,53,Kentucky,L,Gray,Winter,3.1,Yes,Express,Yes,Yes,14,Venmo,Fortnightly
1,2,19,Male,Sweater,Clothing,64,Maine,L,Maroon,Winter,3.1,Yes,Express,Yes,Yes,2,Cash,Fortnightly
2,3,50,Male,Jeans,Clothing,73,Massachusetts,S,Maroon,Spring,3.1,Yes,Free Shipping,Yes,Yes,23,Credit Card,Weekly
3,4,21,Male,Sandals,Footwear,90,Rhode Island,M,Maroon,Spring,3.5,Yes,Next Day Air,Yes,Yes,49,PayPal,Weekly
4,5,45,Male,Blouse,Clothing,49,Oregon,M,Turquoise,Spring,2.7,Yes,Free Shipping,Yes,Yes,31,PayPal,Annually

In [4]:
df.info() # Ye data ka info dega sab kuch data type, null,not null

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3863 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [53]:
df.describe() # ye numeric data ko describe kregea sab columns ka count mean etc.

,customer_id,age,purchase_amount,review_rating,previous_purchases,purchase_frequency_days
count,3900.000000,3900.000000,3900.000000,3900.000000,3900.000000,3900.000000
mean,1950.500000,44.068462,59.764359,3.750051,25.351538,89.133077
std,1125.977353,15.207589,23.685392,0.713590,14.447125,119.037566
min,1.000000,18.000000,20.000000,2.500000,1.000000,7.000000
25%,975.750000,31.000000,39.000000,3.100000,13.000000,14.000000
50%,1950.500000,44.000000,60.000000,3.800000,25.000000,30.000000
75%,2925.250000,57.000000,81.000000,4.400000,38.000000,90.000000
max,3900.000000,70.000000,100.000000,5.000000,50.000000,365.000000

In [54]:
df.describe(include="all") # Ye DataF ke saare columns (numeric + categorical + object + datetime) ka summary deta hai.

,customer_id,age,gender,item_purchased,category,purchase_amount,location,size,color,season,review_rating,subscription_status,shipping_type,discount_applied,previous_purchases,payment_method,frequency_of_purchases,age_group,purchase_frequency_days
count,3900.000000,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900,3900.000000,3900,3900,3900,3900.000000,3900,3900,3900,3900.000000
unique,NaN,NaN,2,25,4,NaN,50,4,25,4,NaN,2,6,2,NaN,6,7,4,NaN
top,NaN,NaN,Male,Blouse,Clothing,NaN,Montana,M,Olive,Spring,NaN,No,Free Shipping,No,NaN,PayPal,Every 3 Months,Young Adult,NaN
freq,NaN,NaN,2652,171,1737,NaN,96,1755,177,999,NaN,2847,675,2223,NaN,677,584,1028,NaN
mean,1950.500000,44.068462,NaN,NaN,NaN,59.764359,NaN,NaN,NaN,NaN,3.750051,NaN,NaN,NaN,25.351538,NaN,NaN,NaN,89.133077
std,1125.977353,15.207589,NaN,NaN,NaN,23.685392,NaN,NaN,NaN,NaN,0.713590,NaN,NaN,NaN,14.447125,NaN,NaN,NaN,119.037566
min,1.000000,18.000000,NaN,NaN,NaN,20.000000,NaN,NaN,NaN,NaN,2.500000,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,7.000000
25%,975.750000,31.000000,NaN,NaN,NaN,39.000000,NaN,NaN,NaN,NaN,3.100000,NaN,NaN,NaN,13.000000,NaN,NaN,NaN,14.000000
50%,1950.500000,44.000000,NaN,NaN,NaN,60.000000,NaN,NaN,NaN,NaN,3.800000,NaN,NaN,NaN,25.000000,NaN,NaN,NaN,30.000000
75%,2925.250000,57.000000,NaN,NaN,NaN,81.000000,NaN,NaN,NaN,NaN,4.400000,NaN,NaN,NaN,38.000000,NaN,NaN,NaN,90.000000
max,3900.000000,70.000000,NaN,NaN,NaN,100.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN,NaN,50.000000,NaN,NaN,NaN,365.000000

In [55]:
df.isnull().sum() # ye Null Value ya missing value check krne k leye hota h .(sum) se True ko 1 aur False ko 0 treat karta hai agar null nhi h to 0

customer_id                0
age                        0
gender                     0
item_purchased             0
category                   0
purchase_amount            0
location                   0
size                       0
color                      0
season                     0
review_rating              0
subscription_status        0
shipping_type              0
discount_applied           0
previous_purchases         0
payment_method             0
frequency_of_purchases     0
age_group                  0
purchase_frequency_days    0
dtype: int64

In [14]:
df.groupby("Category")["Review Rating"].median() # FOR catergory wise median

Category
Accessories    3.8
Clothing       3.7
Footwear       3.8
Outerwear      3.8
Name: Review Rating, dtype: float64

In [11]:
df["Review Rating"]=df.groupby("Category")["Review Rating"].transform(lambda x:x.fillna(x.median())) #Ye code har Category ke andar Review Rating ke missing values ko usi category ke median rating se fill karta hai.

In [12]:
df.isnull().sum()

Customer ID               0
Age                       0
Gender                    0
Item Purchased            0
Category                  0
Purchase Amount (USD)     0
Location                  0
Size                      0
Color                     0
Season                    0
Review Rating             0
Subscription Status       0
Shipping Type             0
Discount Applied          0
Promo Code Used           0
Previous Purchases        0
Payment Method            0
Frequency of Purchases    0
dtype: int64

# Hum Columns name ko lower case me krege or space ko (_) underscore se fill krege. Because its easy to use in coding

In [24]:
df.columns=df.columns.str.lower() # Convert columns name in lower case
df.columns=df.columns.str.replace(' ','_') # fill columns space with underscore

df=df.rename(columns={'purchase_amount_(usd)': 'purchase_amount'}) # Rename krne k leye name

In [25]:
df.columns # To see columns

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'promo_code_used', 'previous_purchases',
       'payment_method', 'frequency_of_purchases'],
      dtype='object')

In [27]:
# Create a Column age_group

labels=['Young Adult','Adult','Middle-aged','Senior'] # jo hume age group k hisab se name dene h
df['age_group']=pd.qcut(df['age'], q=4,labels=labels)  # age column ko 4 equal-sized age groups (quartiles) me divide karta hai aur unko readable labels deta hai

In [33]:
df[['age','age_group']].head(10) # muje age and age group column k top 10 row dekhne k leye

   age    age_group
0   55  Middle-aged
1   19  Young Adult
2   50  Middle-aged
3   21  Young Adult
4   45  Middle-aged
5   46  Middle-aged
6   63       Senior
7   27  Young Adult
8   26  Young Adult
9   57  Middle-aged

In [40]:
# Create a column purchase_frequency_days
df.groupby('frequency_of_purchases')['frequency_of_purchases'].count() # ye dekhne k leye column me kithne count h 

frequency_mapping={      # humne ek Dictionary banaye jo  text ko number me batyegi jaise week me 7 dyas    
'Bi-Weekly' : 14,     
'Every 3 Months': 90,   
'Fortnightly' : 14,      
'Monthly':30,           
'Quarterly' : 90,        
'Weekly' :7, 
 'Annually': 365
}

df['purchase_frequency_days']=df['frequency_of_purchases'].map(frequency_mapping) # map ka use kiya text ko numnber me replace krne k leye

In [42]:
df[['purchase_frequency_days','frequency_of_purchases']].head(10)

   purchase_frequency_days frequency_of_purchases
0                       14            Fortnightly
1                       14            Fortnightly
2                        7                 Weekly
3                        7                 Weekly
4                      365               Annually
5                        7                 Weekly
6                       90              Quarterly
7                        7                 Weekly
8                      365               Annually
9                       90              Quarterly

In [43]:
df[['discount_applied', 'promo_code_used']].head(10)

  discount_applied promo_code_used
0              Yes             Yes
1              Yes             Yes
2              Yes             Yes
3              Yes             Yes
4              Yes             Yes
5              Yes             Yes
6              Yes             Yes
7              Yes             Yes
8              Yes             Yes
9              Yes             Yes

In [47]:
# hum dekege discount or promo code same values h

(df['discount_applied'] == df['promo_code_used']).all()  

#Har single row me check karti hai kidiscount_applied aur promo_code_used equal hain ya nahi
# .all() Tabhi True return karega jab saari rows True hon

np.True_

In [48]:
# Dono same value dete h to hum promo code wale column delete kr dege

df=df.drop('promo_code_used',axis=1)

In [52]:
df.columns # dekhne k leye column delete hua ya nhi

Index(['customer_id', 'age', 'gender', 'item_purchased', 'category',
       'purchase_amount', 'location', 'size', 'color', 'season',
       'review_rating', 'subscription_status', 'shipping_type',
       'discount_applied', 'previous_purchases', 'payment_method',
       'frequency_of_purchases', 'age_group', 'purchase_frequency_days'],
      dtype='object')

In [60]:
# jyptyer notebook ko sql se connect krne k leye ye install karna h

pip install psycopg2-binary sqlalchemy

SyntaxError: invalid syntax (266759529.py, line 2)

In [64]:
from urllib.parse import quote_plus # mera sql ka password speical character me the isleye mene ye lagay

from sqlalchemy import create_engine

# Step 1: Connect to PostgreSQL
#Replace placeholder with your actual details

username="postgres"                # Default users
password=quote_plus("Love@1827")  
host="localhost"                   # if running locally
port="5432"                         # default
database="customer_behaviour" # the database you created in pgadmin

engine=create_engine(f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{database}")

# Step 2 : Load Dataframe into postgresql

table_name="customer" # choose any table name
df.to_sql(table_name,engine,if_exists="replace",index=False)

print(f"Data Successfully loaded into table'{table_name}'in database'{database}'.")

Data Successfully loaded into table'customer'in database'customer_behaviour'.

In [72]:
top10 = (
    df.groupby('item_purchased')['review_rating']
      .mean()
      .sort_values(ascending=False)
      .head(10)
)

print(top10)

Series([], Name: review_rating, dtype: float64)